Revit 2027 API
IPipeFittingAndAccessoryPressureDropServer.Calculate Method
 Calculate the pipe fitting and pipe accessory coefficient.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool Calculate(
	PipeFittingAndAccessoryPressureDropData data
)
Function Calculate (
	data As PipeFittingAndAccessoryPressureDropData
) As Boolean
bool Calculate(
	PipeFittingAndAccessoryPressureDropData^ data
)
abstract Calculate :
        data : PipeFittingAndAccessoryPressureDropData -> bool
Parameters
data PipeFittingAndAccessoryPressureDropData
 The input and output data of the calculation.
Return Value
Boolean
 True if calculation succeeds. False if calculation fails.
See Also
Reference
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace